# -*- coding: utf-8 -*-
"""
Created on Wed Feb 23 15:39:37 2022

@author: rkdtk
"""

import pandas as pd
import numpy as np

shops=pd.read_csv("./shops.csv")

# 0, 57 중복 / 1, 58 중복
# 0, 6은 쇼핑몰 넣기엔 다른 건물 같음 상가나 주거용 건물로 보임
# 10, 11번도 주거용 건물 같기도 함
# 팀원들과 상의후 정수인코딩 및 종속변수와 상관분석을 통해 결정

# 0, 1 제거
# 57,58 살리기
# train 데이터에서는 합치기
# 나머지 기타
shp_city = ['야쿠츠크', '야쿠츠크', '아디게야', '발라시하', '볼츠스키',
           '볼로그다', '보로네슈', '보로네슈','보로네슈', '브로네슈',
           '쥬코브스키', '쥬코브스키', '온라인', '카잔', '카잔',
           '칼루가', '콜롬나', '크라스노야르스크', '크라스노야르스크', '쿠르스크',
           '모스크바', '모스크바', '모스크바', '모스크바', '모스크바',
           '모스크바', '모스크바', '모스크바', '모스크바', '모스크바',
           '모스크바', '모스크바', '모스크바', '미티시치', '니즈니노브고로드',
           '니즈니노브고로드', '노보시비르스크','노보시비르스크', '옴스크', '로스토프온돈',
           '로스토프온돈', '로스토프온돈', '상트페테르부르크', '상트페테르부르크', '사마라',
           '사마라', '세르기예프 포사트', '수르구트', '톰스크', '투먼',
           '투먼', '투먼', '우파', '우파', '힘키',
           '모스크바','체호프', '아쿠츠크', '아쿠츠크', '야로슬라블']
shp_type = ['기타', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '기타', '쇼핑몰', '쇼핑몰', '기타',
           '기타', '기타', '온라인몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '기타', '쇼핑몰', '쇼핑몰', '컴퓨터용품점', '컴퓨터용품점',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰',
           '컴퓨터용품점', '쇼핑몰', '쇼핑몰', '쇼핑몰', '쇼핑몰']

shops['shp_city'] = shp_city
shops['shp_type'] = shp_type

shops
